[
  {
    "_id": "1",
    "title": "Funeral Expense and immediate support",
    "description": "<p>It is with deep sadness Nepal Center of North Carolina, Inc. announces the death of our beloved community member, Bharat Raj Oli.</p>
<p><br />Bharat Raj Oli was admitted to Duke University Hospital on June 4,
    2021 with a large intracranial hemorrhage or brain bleed. He was taken to surgery immediately for an emergency hemicraniectomy. Unfortunately, this was a devastating and non-survivable hemorrhage.</p>
<p>Bharat came to the US on the DV1 program in May, 2010. He died this morning Sunday, June 6th at the age of 34.</p>
<p>I give my heartfelt thanks to our community leaders who have stepped up and helped with counseling family members in Nepal and dealing with logistics here.</p>
<p>Surviving are his mother, wife,
    2- year old son, and two sisters who all are in Nepal. Unfortunately, Bharat was by himself here and was the sole bread winner for the family. He was also suffering chronic health problems and was not able to work fully for a while.</p>
<p>As you can imagine, the family is devastated both financially and emotionally. Bharat has touched many of us here with his kind demeanor and ever helping attitude. This is our time to open our hearts and help. This Gofundme campaign has been established to help cover his funeral expenses here and provide immediate economic relief to his family in Nepal.</p>",
    "image": "https://d2g8igdw686xgo.cloudfront.net/57616471_1623017622550747_r.jpeg",
    "donation": "27910.50",
    "total_donation": "35000",
    "percentage": "80",
    "category": "Non-profit",
    "date": "2021-06-01T14:18:59.556+00:00",
    "user": "Joe Frimpong"
  },
  {
    "_id": "2",
    "title": "Vegan Doughnut Company Support",
    "description":"<p>On Wednesday, May 26, 2021, we were made aware that the beloved mother of business owners Kharisma and Kyra Mayo, unexpectedly passed away. Kharisma and Kyra are the young owners of the beloved The Vegan Doughnut Company here in Cleveland, Ohio. The Vegan Doughnut Company is Ohio's 1st and only 100% Vegan Doughnut Shop! This black-owned, family-owned, women-owned business has brought smiles to many faces because of its incredible customer service and delicious doughnuts!</p>
<p>To know the Mayo family is to love them and to know Kharisma and Kyra, you know how important and special their mother meant to them and their business.</p>
<p>Time stops when a family experiences the passing of a loved one, but business expenses, bills, and financial obligations do not. The girls will have to take a break from their business but during their time of grieving and loss, their business should not suffer as well.</p>
<p>I am calling on the community to make sure that this business stays afloat during this family's difficult time. As a vegan business owner, I have received approval from the family to manage and collect donations for The Vegan Doughnut Company. This money will help cover any financial obligations while the girls are on a much-needed hiatus.</p>
<p>Any amount is welcomed and appreciated. Please feel free to share!</p>",
"image": "https://images.gofundme.com/dfXRmIu9AbgTq_f_OXkUalXX_fA=/720x405/https://d2g8igdw686xgo.cloudfront.net/57329171_1622136604154854_r.jpeg",
    "donation": "13,865",
    "total_donation": "25,000",
    "percentage": "55",
    "category": "Business & Entrepreneurs",
    "date": "2021-05-01T14:18:59.556+00:00",
    "user": "Ama Gyakie"
  },
  {
    "_id": "3",
    "title": "Help Re-Open Family Billiards",
    "description": "<p>Hi Friends, we hope you have all been safe and are doing well in light of recent events. Unfortunately, due to the Covid-19 pandemic, Family Billiards was forced to temporarily close in March of 2020 and although it has not been an easy journey coping through the last 15 months, we are optimistic about the future. We are excited and eager to reopen our doors but we need your help! Since the pool hall was closed, the business received no income and therefore was unable to keep up with the rental payments, etc. As restrictions are being lightened and the state is in anticipation of reopening June 15th we expect to be apart of that long awaited process. Anything you can contribute would be helpful, as you know we have supported the Billiard community for 55 years and as one of the last True pool halls left in San Francisco, we want to continue our legacy in supporting this classic and beloved pastime. Please share this with any and everyone you know, we hope to see you all very soon. Thank you in advance for all your contributions!</p>",
    "donation": "5,650",
    "total_donation": "150,000",
    "percentage": "5",
    "category": "Business & Entrepreneurs",
    "date": "2021-01-01T14:18:59.556+00:00",
    "user": "John Omar"
  }
]
